---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetManyLoopsInSketch
source: html/e81f2dd0-f5cf-44a3-27d3-d44906898430.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetManyLoopsInSketch Property

The bend profile cannot contain two or more disconnected segments. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.

## Syntax (C#)
```csharp
public static FailureDefinitionId BentFabricSheetManyLoopsInSketch { get; }
```